package arrays.aelita;

public class ZweiArrays {
    public static void main(String[] args) {
        // Пайдаланучулардын аты-жөндөрү жана жаштары
        String[] пайдаланучу_аты = {"Актан", "Айдана", "Адинай", "Каухар", "Гулназ"};
        int[] пайдаланучу_жашы = {24, 30, 28, 24, 27};

        // Орточо жашты эсептөө
        int жаштардын_жалпы_суммасы = 0;
        for (int жаш : пайдаланучу_жашы) {
            жаштардын_жалпы_суммасы += жаш;
        }
        double орточо_жаш = (double) жаштардын_жалпы_суммасы / пайдаланучу_жашы.length;

        // Натыйжаны чыгарыңыз
        System.out.println("Пайдаланучулардын аты-жөндөрү:");
        for (String аты : пайдаланучу_аты) {
            System.out.println(аты);
        }

        System.out.println("Пайдаланучулардын жаштары:");
        for (int жаш : пайдаланучу_жашы) {
            System.out.println(жаш);
        }

        System.out.println("Орточо жаш: " + орточо_жаш);
    }
}
